[
  {
    "fruitId": "fragaria_ananassa",
    "name": "Strawberry",
    "text": "The garden strawberry (or simply strawberry; Fragaria × ananassa) is a widely grown hybrid species of the genus Fragaria, collectively known as the strawberries, which are cultivated worldwide for their fruit. The fruit is widely appreciated for its characteristic aroma, bright red color, juicy texture, and sweetness. It is consumed in large quantities, either fresh or in such prepared foods as jam, juice, pies, ice cream, milkshakes, and chocolates. Artificial strawberry flavorings and aromas are also widely used in products such as candy, soap, lip gloss, perfume, and many others.\n\nThe garden strawberry was first bred in Brittany, France, in the 1750s via a cross of Fragaria virginiana from eastern North America and Fragaria chiloensis, which was brought from Chile by Amédée-François Frézier in 1714. Cultivars of Fragaria × ananassa have replaced, in commercial production, the woodland strawberry (Fragaria vesca), which was the first strawberry species cultivated in the early 17th century.\n\nThe strawberry is not, from a botanical point of view, a berry. Technically, it is an aggregate accessory fruit, meaning that the fleshy part is derived not from the plant's ovaries but from the receptacle that holds the ovaries. Each apparent \"seed\" (achene) on the outside of the fruit is actually one of the ovaries of the flower, with a seed inside it.\n\nIn 2019, world production of strawberries was 9 million tonnes, led by China with 40% of the total.",
    "reference": "https://en.wikipedia.org/wiki/Strawberry",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Fragaria_%C3%97_ananassa.JPG"
  },
  {
    "fruitId": "vitis_vinifera",
    "name": "Muscat",
    "text": "Vitis vinifera, the common grape vine, is a species of flowering plant, native to the Mediterranean region, Central Europe, and southwestern Asia, from Morocco and Portugal north to southern Germany and east to northern Iran. There are currently between 5,000 and 10,000 varieties of Vitis vinifera grapes though only a few are of commercial significance for wine and table grape production.\n\nThe wild grape is often classified as Vitis vinifera sylvestris (in some classifications considered Vitis sylvestris), with Vitis vinifera vinifera restricted to cultivated forms. Domesticated vines have hermaphrodite flowers, but sylvestris is dioecious (male and female flowers on separate plants) and pollination is required for fruit to develop.\n\nGrapes can be eaten fresh or dried to produce raisins, sultanas, and currants. Grape leaves are used in the cuisine of many cultures. The fresh grapes can also be processed into juice that is fermented to make wine and vinegar. Cultivars of Vitis vinifera form the basis of the majority of wines produced around the world. All of the familiar wine varieties belong to Vitis vinifera, which is cultivated on every continent except for Antarctica, and in all the major wine regions of the world.",
    "reference": "https://en.wikipedia.org/wiki/Vitis_vinifera",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Cabernet_Sauvignon_Gaillac.jpg/220px-Cabernet_Sauvignon_Gaillac.jpg"
  },
  {
    "fruitId": "amygdalus_persica",
    "name": "Peach",
    "text": "The peach (Prunus persica) is a deciduous tree first domesticated and cultivated in Zhejiang province of Eastern China.It bears edible juicy fruits with various characteristics, most called peaches and others (the glossy-skinned, non-fuzzy varieties), nectarines.\n\nThe specific name persica refers to its widespread cultivation in Persia (modern-day Iran), from where it was transplanted to Europe. It belongs to the genus Prunus, which includes the cherry, apricot, almond, and plum, in the rose family. The peach is classified with the almond in the subgenus Amygdalus, distinguished from the other subgenera by the corrugated seed shell (endocarp). Due to their close relatedness, the kernel of a peach stone tastes remarkably similar to almond, and peach stones are often used to make a cheap version of marzipan, known as persipan.\n\nPeaches and nectarines are the same species, though they are regarded commercially as different fruits. The skin of nectarines lacks the fuzz (fruit-skin trichomes) that peach skin has; a mutation in a single gene (MYB25) is thought to be responsible for the difference between the two.\n\nIn 2018, China produced 62% of the world total of peaches and nectarines.",
    "reference": "https://en.wikipedia.org/wiki/Peach",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Autumn_Red_peaches.jpg/220px-Autumn_Red_peaches.jpg"
  },
  {
    "fruitId": "cucumis_melo",
    "name": "Melon",
    "text": "Cucumis melo, also known as melon, is a species of Cucumis that has been developed into many cultivated varieties. The fruit is a pepo. The flesh is either sweet or bland, with or without a musky aroma, and the rind can be smooth (such as honeydew), ribbed (such as cantaloupe), wrinkled (such as casaba melon), or netted (such as muskmelon). In North America, the sweet-flesh varieties are often collectively called muskmelon, including the musky netted-rind varieties and the inodorous smooth-rind varieties, and cantaloupe usually means the former type. However, muskmelon in a narrow sense only refers to the musky netted-rind type, while the true cantaloupe is the European type with ribbed and often warty rind that is seldom grown in North America.\n\nThe origin of melons is not known. Research has revealed that seeds and rootstocks were among the goods traded along the caravan routes of the Ancient World. Some botanists consider melons native to the Levant and Egypt, while others place their origin in Iran, India or Central Asia. Still others support an African origin, and in modern times wild melons can still be found in some African countries.",
    "reference": "https://en.wikipedia.org/wiki/Cucumis_melo",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Cucurbitales_-_Cucumis_melo_-_1.jpg"
  },
  {
    "fruitId": "pyrus_pyrifolia",
    "name": "Pear",
    "text": "Pyrus pyrifolia is a species of pear tree native to East Asia. The tree's edible fruit is known by many names, including: Asian pear, Japanese pear, Chinese pear, Korean pear, Taiwanese pear, apple pear, zodiac pear, three-halves pear, papple, naspati and sand pear. Along with cultivars of P. × bretschneideri and P. ussuriensis, the fruit is also called the nashi pear. Cultivars derived from Pyrus pyrifolia are grown throughout East Asia, and in other countries such as India, Nepal, Australia, New Zealand, and the United States (e.g., California). Traditionally in East Asia the tree's flowers are a popular symbol of early spring, and it is a common sight in gardens and the countryside.\n\nThe fruits are not generally baked in pies or made into jams because they have a high water content and a crisp, grainy texture, very different from the European varieties. They are commonly served raw and peeled. The fruit tends to be quite large and fragrant, and when carefully wrapped (it has a tendency to bruise because of its juiciness), it can last for several weeks or more in a cold, dry place.",
    "reference": "https://en.wikipedia.org/wiki/Pyrus_pyrifolia",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Pyrus_pyrifolia_001.jpg/640px-Pyrus_pyrifolia_001.jpg"
  },
  {
    "fruitId": "citrus_unshiu",
    "name": "Citrus unshiu",
    "text": "Citrus unshiu is a semi-seedless and easy-peeling citrus species, also known as miyagawa mandarin, unshu mikan, cold hardy mandarin, satsuma mandarin, satsuma orange, naartjie, and tangerine. Citrus unshiu was named after Unshu (Wenzhou), a famous production area of mandarin oranges in China, in the late Edo period of Japan. It is said to have originated in either Japan or China, and because of its name, it is often described as originating in China; however, due to multiple genetic studies conducted in the 2010s, the theory that the maternal species of Citrus unshiu was Kishu (Citrus kinokuni) and the paternal species was Kunenbo (Citrus nobilis Lour. var. kunip) and that it was created in the Satsuma province in Japan became more credible. During the Edo period, Kishu was the most popular because there was a popular superstition that eating Citrus unshiu (Satsuma) without seeds made people more prone to infertility. Citrus unshiu became popular in Japan after the modernization started in the Meiji period. It was introduced to the West from the Satsuma region of Japan in 1878.",
    "reference": "https://en.wikipedia.org/wiki/Citrus_unshiu",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Citrus_unshiu_20101118_b.jpg/640px-Citrus_unshiu_20101118_b.jpg"
  },
  {
    "fruitId": "mangifera_indica",
    "name": "Mango",
    "text": "A mango is an edible stone fruit produced by the tropical tree Mangifera indica which is believed to have originated from the region between northwestern Myanmar, Bangladesh, and northeastern India. M. indica has been cultivated in South and Southeast Asia since ancient times resulting in two distinct types of modern mango cultivars: the \"Indian type\" and the \"Southeast Asian type\". Other species in the genus Mangifera also produce edible fruits that are also called \"mangoes\", the majority of which are found in the Malesian ecoregion.\n\nWorldwide, there are several hundred cultivars of mango. Depending on the cultivar, mango fruit varies in size, shape, sweetness, skin color, and flesh color which may be pale yellow, gold, green, or orange. Mango is the national fruit of India, Pakistan and the Philippines, while the mango tree is the national tree of Bangladesh.",
    "reference": "https://en.wikipedia.org/wiki/Mango",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Mango_-_single.jpg/640px-Mango_-_single.jpg"
  },
  {
    "fruitId": "vitis_spp",
    "name": "Vitaceae",
    "text": "The Vitaceae are a family of flowering plants, with 14 genera and around 910 known species, including common plants such as grapevines (Vitis spp.) and Virginia creeper (Parthenocissus quinquefolia). The family name is derived from the genus Vitis.\n\nMost Vitis species have 38 chromosomes (n=19), but 40 (n=20) in subgenus Muscadinia, while Ampelocissus, Parthenocissus, and Ampelopsis also have 40 chromosomes (n=20) and Cissus has 24 chromosomes (n=12).\n\nThe family is economically important as the berries of Vitis species, commonly known as grapes, are an important fruit crop and, when fermented, produce wine.\n\nSpecies of the genus Tetrastigma serve as hosts to parasitic plants in the family Rafflesiaceae.",
    "reference": "https://en.wikipedia.org/wiki/Vitaceae",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Corvinone_bunches_in_august_valpolicella_region.jpg/640px-Corvinone_bunches_in_august_valpolicella_region.jpg"
  },
  {
    "fruitId": "musa_spp",
    "name": "Banana",
    "text": "A banana is an elongated, edible fruit – botanically a berry – produced by several kinds of large herbaceous flowering plants in the genus Musa. In some countries, bananas used for cooking may be called \"plantains\", distinguishing them from dessert bananas. The fruit is variable in size, color, and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a rind, which may be green, yellow, red, purple, or brown when ripe. The fruits grow upward in clusters near the top of the plant. Almost all modern edible seedless (parthenocarp) bananas come from two wild species – Musa acuminata and Musa balbisiana. The scientific names of most cultivated bananas are Musa acuminata, Musa balbisiana, and Musa × paradisiaca for the hybrid Musa acuminata × M. balbisiana, depending on their genomic constitution. The old scientific name for this hybrid, Musa sapientum, is no longer used.\n\nMusa species are native to tropical Indomalaya and Australia, and are likely to have been first domesticated in Papua New Guinea. They are grown in 135 countries, primarily for their fruit, and to a lesser extent to make fiber, banana wine, and banana beer and as ornamental plants. The world's largest producers of bananas in 2017 were India and China, which together accounted for approximately 38% of total production.\n\nWorldwide, there is no sharp distinction between \"bananas\" and \"plantains\". Especially in the Americas and Europe, \"banana\" usually refers to soft, sweet, dessert bananas, particularly those of the Cavendish group, which are the main exports from banana-growing countries. By contrast, Musa cultivars with firmer, starchier fruit are called \"plantains\". In other regions, such as Southeast Asia, many more kinds of banana are grown and eaten, so the binary distinction is not as useful and is not made in local languages.\n\nThe term \"banana\" is also used as the common name for the plants that produce the fruit. This can extend to other members of the genus Musa, such as the scarlet banana (Musa coccinea), the pink banana (Musa velutina), and the Fe'i bananas. It can also refer to members of the genus Ensete, such as the snow banana (Ensete glaucum) and the economically important false banana (Ensete ventricosum). Both genera are in the banana family, Musaceae.",
    "reference": "https://en.wikipedia.org/wiki/Banana",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Cavendish_banana_from_Maracaibo.jpg/640px-Cavendish_banana_from_Maracaibo.jpg"
  },
  {
    "fruitId": "prunus_cerasus",
    "name": "Cherry",
    "text": "A cherry is the fruit of many plants of the genus Prunus, and is a fleshy drupe (stone fruit).\n\nCommercial cherries are obtained from cultivars of several species, such as the sweet Prunus avium and the sour Prunus cerasus. The name 'cherry' also refers to the cherry tree and its wood, and is sometimes applied to almonds and visually similar flowering trees in the genus Prunus, as in \"ornamental cherry\" or \"cherry blossom\". Wild cherry may refer to any of the cherry species growing outside cultivation, although Prunus avium is often referred to specifically by the name \"wild cherry\" in the British Isles.",
    "reference": "https://en.wikipedia.org/wiki/Cherry",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Royal_Ann_cherries.jpg/640px-Royal_Ann_cherries.jpg"
  },
  {
    "fruitId": "ananas_comosus",
    "name": "Pineapple",
    "text": "The pineapple (Ananas comosus) is a tropical plant with an edible fruit; it is the most economically significant plant in the family Bromeliaceae. The pineapple is indigenous to South America, where it has been cultivated for many centuries. The introduction of the pineapple to Europe in the 17th century made it a significant cultural icon of luxury. Since the 1820s, pineapple has been commercially grown in greenhouses and many tropical plantations.\n\nPineapples grow as a small shrub; the individual flowers of the unpollinated plant fuse to form a multiple fruit. The plant is normally propagated from the offset produced at the top of the fruit, or from a side shoot, and typically mature within a year.",
    "reference": "https://en.wikipedia.org/wiki/Pineapple",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Pineapples_Kenya.jpg/640px-Pineapples_Kenya.jpg"
  },
  {
    "fruitId": "citrullus_lanatus",
    "name": "Watermelon",
    "text": "Watermelon (Citrullus lanatus) is a flowering plant species of the Cucurbitaceae family and the name of its edible fruit. A scrambling and trailing vine-like plant, it is a highly cultivated fruit worldwide, with more than 1,000 varieties.\n\nWatermelon is grown in favorable climates from tropical to temperate regions worldwide for its large edible fruit, which is a berry with a hard rind and no internal divisions, and is botanically called a pepo. The sweet, juicy flesh is usually deep red to pink, with many black seeds, although seedless varieties exist. The fruit can be eaten raw or pickled, and the rind is edible after cooking. It may also be consumed as a juice or as an ingredient in mixed beverages.\n\nKordofan melons from Sudan are the closest relatives and may be progenitors of modern, cultivated watermelons. Wild watermelon seeds were found in Uan Muhuggiag, a prehistoric site in Libya that dates to approximately 3500 BC. Watermelons were domesticated in Egypt by 2000 BC, although they were not the sweet modern variety. Sweet dessert watermelons spread across the Mediterranean world during Roman times.\n\nConsiderable breeding effort has developed disease-resistant varieties. Many cultivars are available that produce mature fruit within 100 days of planting. In 2017, China produced about two-thirds of the world total of watermelons.",
    "reference": "https://en.wikipedia.org/wiki/Watermelon",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Citrullus_lanatus5SHSU.jpg/640px-Citrullus_lanatus5SHSU.jpg"
  },
  {
    "fruitId": "malus_pumila",
    "name": "Apple",
    "text": "An apple is an edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia, where its wild ancestor, Malus sieversii, is still found today. Apples have been grown for thousands of years in Asia and Europe and were brought to North America by European colonists. Apples have religious and mythological significance in many cultures, including Norse, Greek, and European Christian tradition.\n\nApples grown from seed tend to be very different from those of their parents, and the resultant fruit frequently lacks desired characteristics. Generally, apple cultivars are propagated by clonal grafting onto rootstocks. Apple trees grown without rootstocks tend to be larger and much slower to fruit after planting. Rootstocks are used to control the speed of growth and the size of the resulting tree, allowing for easier harvesting.\n\nThere are more than 7,500 known cultivars of apples. Different cultivars are bred for various tastes and uses, including cooking, eating raw, and cider production. Trees and fruit are prone to a number of fungal, bacterial, and pest problems, which can be controlled by a number of organic and non-organic means. In 2010, the fruit's genome was sequenced as part of research on disease control and selective breeding in apple production.\n\nWorldwide production of apples in 2018 was 86 million tonnes, with China accounting for nearly half of the total.",
    "reference": "https://en.wikipedia.org/wiki/Apple",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/55/Apple_orchard_in_Tasmania.jpg"
  },
  {
    "fruitId": "actinidia_deliciosa",
    "name": "Kiwifruit",
    "text": "Kiwifruit (often shortened to kiwi in North America and continental Europe) or Chinese gooseberry is the edible berry of several species of woody vines in the genus Actinidia. The most common cultivar group of kiwifruit (Actinidia deliciosa 'Hayward') is oval, about the size of a large hen's egg: 5–8 centimetres (2–3 inches) in length and 4.5–5.5 cm (1+3⁄4–2+1⁄4 in) in diameter. It has a thin, fuzzy, fibrous, tart but edible light brown skin and light green or golden flesh with rows of tiny, black, edible seeds. The fruit has a soft texture with a sweet and unique flavour.\n\nKiwifruit is native to central and eastern China. The first recorded description of the kiwifruit dates to the 12th century during the Song dynasty. In the early 20th century, cultivation of kiwifruit spread from China to New Zealand, where the first commercial plantings occurred. The fruit became popular with British and American servicemen stationed in New Zealand during World War II, and later became commonly exported, first to Great Britain and then to California in the 1960s.",
    "reference": "https://en.wikipedia.org/wiki/Kiwifruit",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/%28kiwifruit_or_Chinese_gooseberry%29_is_the_edible_berry_of_a_woody_vine_in_the_genus_Actinidia.JPG/640px-%28kiwifruit_or_Chinese_gooseberry%29_is_the_edible_berry_of_a_woody_vine_in_the_genus_Actinidia.JPG"
  },
  {
    "fruitId": "vaccinium_sect",
    "name": "Blueberry ",
    "text": "Blueberries are a widely distributed and widespread group of perennial flowering plants with blue or purple berries. They are classified in the section Cyanococcus within the genus Vaccinium. Vaccinium also includes cranberries, bilberries, huckleberries and Madeira blueberries. Commercial blueberries—both wild (lowbush) and cultivated (highbush)—are all native to North America. The highbush varieties were introduced into Europe during the 1930s.\n\nBlueberries are usually prostrate shrubs that can vary in size from 10 centimeters (4 inches) to 4 meters (13 feet) in height. In commercial production of blueberries, the species with small, pea-size berries growing on low-level bushes are known as \"lowbush blueberries\" (synonymous with \"wild\"), while the species with larger berries growing on taller, cultivated bushes are known as \"highbush blueberries\". Canada is the leading producer of lowbush blueberries, while the United States produces some 40% of the world supply of highbush blueberries.",
    "reference": "https://en.wikipedia.org/wiki/Blueberry",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/P1060636_Blueberries.jpg/640px-P1060636_Blueberries.jpg"
  },
  {
    "fruitId": "pyrus_communis",
    "name": "Pear",
    "text": "Pyrus communis, the common pear, is a species of pear native to central and eastern Europe, and western Asia.\n\nIt is one of the most important fruits of temperate regions, being the species from which most orchard pear cultivars grown in Europe, North America, and Australia have been developed. Two other species of pear, the Nashi pear (Pyrus pyrifolia) and the hybrid Chinese white or ya pear (Pyrus × bretschneideri, Chinese: 白梨; pinyin: báilí) are more widely grown in East Asia.",
    "reference": "https://en.wikipedia.org/wiki/Pyrus_communis",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Pyrus_communis._Peral.jpg/640px-Pyrus_communis._Peral.jpg"
  }
]